src/Documents/ПеремещениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.ФинансовыеЦели</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПеремещениеДенег/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	СуммаЗачисления = Сумма;
	
	Если СчетПолучатель.Валюта <> Справочники.ВалютыДенежныхСредств.БелорусскийРубль Тогда  
		
		Отбор = Новый Структура("Валюта", СчетПолучатель.Валюта);                
		
		ДанныеКурса = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Отбор);
		
		Если ДанныеКурса.Курс > 0 Тогда
			
			Кратность = ?(ДанныеКурса.Кратность = 0, 1, ДанныеКурса.Кратность);
			КурсСУчетомКратности = ДанныеКурса.Курс / Кратность;
			
			СуммаЗачисления = Окр(Сумма / КурсСУчетомКратности, 2);
			
		Иначе 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не найден курс для валюты %1 на дату %2", СчетПолучатель.Валюта, Формат(Дата, "ДФ=dd.MM.yyyy"));
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
	КонецЕсли;

	Движения.ОстаткиДенежныхСредств.Записывать = Истина; 
	
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	
	Движение.Период 	= Дата;
	Движение.Кошелек 	= СчетПолучатель;
	
	Движение.Сумма = СуммаЗачисления;

	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	
	Движение.Период 	= Дата;
	Движение.Кошелек 	= СчетОтправитель;
	
	Движение.Сумма = Сумма;
 	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КонтрольПриПроведенииДокументов.ПроверитьОстаткиДенежныхСредств(Дата, СчетОтправитель, Сумма, Отказ); 	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФинансовыеЦели") Тогда
		
		Комментарий = ДанныеЗаполнения.Описание;
		СчетПолучатель = ДанныеЗаполнения.СвязанныйСчет;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
